app/controllers/posts_controller.rb

  def create
    debugger
    @post = Post.new(post_params)

    respond_to do |format|
      if @post.save
---
INSERT INTO "posts" ("name", "author", "created_at", "updated_at", "status") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["name", "dl;jsa;lfjas;ljf;sa"], ["author", "as;ldfjall"], ["created_at", "2023-06-14 07:34:41.986109"], ["updated_at", "2023-06-14 07:34:41.986109"], ["status", "public"]]